Revit 2026 API

# IPerformanceAdviserRule Interface

---

Base class to derive specific performance adviser rules from.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IPerformanceAdviserRule
```
```vb
Public Interface IPerformanceAdviserRule
```
```cpp
public interface class IPerformanceAdviserRule
```
```fsharp
type IPerformanceAdviserRule = interface end
```

The IPerformanceAdviserRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExecuteElementCheck | Invoked by performance advisor for each element to be checked. |
|  | FinalizeCheck | Invoked by performance advisor once in the end of the check. |
|  | GetDescription | Retrieves the description of the rule. |
|  | GetElementFilter | Retrieves a filter to restrict elements to be checked. |
|  | GetName | Retrieves the name of the rule. |
|  | InitCheck | Invoked by performance advisor once in the beginning of the check. If rule checks document as a whole, the check can be performed in this method. |
|  | WillCheckElements | Reports if rule needs to be executed on individual elements. |

#### Reference

Autodesk.Revit.DB Namespace